0.57.2119-1/Catalogs/ККСНГ_МашиночитаемыеДоверенности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_МашиночитаемыеДоверенности</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ККСНГ_Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННДоверителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяСистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенностиОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервоначальнойДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьФайлДоверенности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьФайлПодписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлДоверенности</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлПодписи</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доверители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОГРН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СНИЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подписанты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Полномочия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОГРН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СНИЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сертификаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отпечаток</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_МашиночитаемыеДоверенности/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДоступныеОрганизации();
	УстановитьОрганизацию();
	Элементы.ОрганизацияЭДО.Доступность = (Элементы.ОрганизацияЭДО.СписокВыбора.Количество() > 0);
	
	ЭтотОбъект.ОрганизацияЭДОИзПараметров = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.Параметры, "ОрганизацияЭДО");
	Элементы.Список.РежимВыбора = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.Параметры, "РежимВыбора", Ложь);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ОрганизацияЭДОИзПараметров) Тогда
		
		Если Элементы.ОрганизацияЭДО.СписокВыбора.НайтиПоЗначению(ЭтотОбъект.ОрганизацияЭДОИзПараметров) = Неопределено Тогда
			ВызватьИсключение "Указана организация ЭДО, недоступная пользователю.";
		КонецЕсли;
		
		ЭтотОбъект.ОрганизацияЭДО = ЭтотОбъект.ОрганизацияЭДОИзПараметров;
		Элементы.ОрганизацияЭДО.Доступность = Ложь;
		
	КонецЕсли;
	
	НастроитьДинамическийСписок();
	УстановитьОтборПоОрганизации();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ОрганизацияЭДОИзПараметров) Тогда
		ЭтотОбъект.ОрганизацияЭДО = ЭтотОбъект.ОрганизацияЭДОИзПараметров;
	Иначе
		УстановитьОрганизацию();
	КонецЕсли;
	
	УстановитьОтборПоОрганизации();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияЭДОПриИзменении(Элемент)
	
	УстановитьОтборПоОрганизации();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Перем СписокДоверенностей, Доверенность;
	Перем ВидимостьПериода, ВидимостьПредставителей, ВидимостьСертификатов;
	Перем ДополнительныеДанные, СтрокаСписка, ДанныеСтроки;
	
	СписокДоверенностей = Строки.ПолучитьКлючи();
	
	// Проверим видимость колонок, если отключены, то заполнять данные не нужно
	ВидимостьПериода = Ложь;
	ВидимостьПредставителей = Ложь;
	ВидимостьСертификатов = Ложь;
	Для каждого СтрокаСписка Из Строки Цикл
		ВидимостьПериода = СтрокаСписка.Значение.Данные.Свойство("ПериодДействия");
		ВидимостьПредставителей = СтрокаСписка.Значение.Данные.Свойство("СписокПредставителей");
		ВидимостьСертификатов = СтрокаСписка.Значение.Данные.Свойство("СписокСертификатов");
		Прервать;
	КонецЦикла;
	
	Если ВидимостьПериода Тогда
		Для каждого СтрокаСписка Из Строки Цикл
			ДанныеСтроки = СтрокаСписка.Значение.Данные;
			ДанныеСтроки.ПериодДействия = Новый СтандартныйПериод(ДанныеСтроки.ДатаНачала, ДанныеСтроки.ДатаОкончания);
		КонецЦикла;
	КонецЕсли;
	
	Если ВидимостьПредставителей Или ВидимостьСертификатов Тогда
		
		ДополнительныеДанные = ПолучитьДанныеКолонокДинамическогоСписка(СписокДоверенностей);
		
		Для каждого Доверенность Из ДополнительныеДанные Цикл
			
			ДанныеСтроки = Новый Структура;
			ДанныеСтроки.Вставить("СписокПредставителей", Доверенность.Значение.СписокПредставителей);
			ДанныеСтроки.Вставить("СписокСертификатов", Доверенность.Значение.СписокСертификатов);
			
			СтрокаСписка = Строки.Получить(Доверенность.Ключ);
			Если СтрокаСписка <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаСписка.Данные, ДанныеСтроки);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьДинамическийСписок()
	
	Перем ПоляСОграничениями;
	
	// Устанавливаем обязательное получение полей списка
	ЭтотОбъект.Список.УстановитьОбязательноеИспользование("Ссылка", Истина);
	ЭтотОбъект.Список.УстановитьОбязательноеИспользование("Владелец", Истина);
	ЭтотОбъект.Список.УстановитьОбязательноеИспользование("ПометкаУдаления", Истина);
	ЭтотОбъект.Список.УстановитьОбязательноеИспользование("ДатаНачала", Истина);
	ЭтотОбъект.Список.УстановитьОбязательноеИспользование("ДатаОкончания", Истина);
	
	// Устанавливаем ограничения на расчетные колонки
	ПоляСОграничениями = Новый Массив();
	ПоляСОграничениями.Добавить("СписокПредставителей");
	ПоляСОграничениями.Добавить("СписокСертификатовЭП");
	ЭтотОбъект.Список.УстановитьОграниченияИспользованияВГруппировке(ПоляСОграничениями);
	ЭтотОбъект.Список.УстановитьОграниченияИспользованияВПорядке(ПоляСОграничениями);
	ЭтотОбъект.Список.УстановитьОграниченияИспользованияВОтборе(ПоляСОграничениями);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоОрганизации()
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтотОбъект.Список, "Владелец", ЭтотОбъект.ОрганизацияЭДО, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныеОрганизации()
	
	Перем ДоступныеОрганизации;
	
	ДоступныеОрганизации = ККСНГ_ОбщегоНазначенияВызовСервера.ПолучитьДоступныеПрофилиЭДОПользователя();
	Элементы.ОрганизацияЭДО.СписокВыбора.ЗагрузитьЗначения(ДоступныеОрганизации);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОрганизацию()
	
	Если Не ЭтотОбъект.ОрганизацияЭДО.Пустая() И (ЭтотОбъект.ОрганизацияЭДО.ПометкаУдаления Или ЭтотОбъект.ОрганизацияЭДО.ПолучитьОбъект() = Неопределено) Тогда
		ЭтотОбъект.ОрганизацияЭДО = Неопределено;
	КонецЕсли;
	
	Если Не ЭтотОбъект.ОрганизацияЭДО.Пустая() И Элементы.ОрганизацияЭДО.СписокВыбора.НайтиПоЗначению(ЭтотОбъект.ОрганизацияЭДО) = Неопределено Тогда
		ЭтотОбъект.ОрганизацияЭДО = Неопределено;
	КонецЕсли;
	
	Если ЭтотОбъект.ОрганизацияЭДО.Пустая() И Элементы.ОрганизацияЭДО.СписокВыбора.Количество() > 0 Тогда
		ЭтотОбъект.ОрганизацияЭДО = Элементы.ОрганизацияЭДО.СписокВыбора[0].Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеКолонокДинамическогоСписка(СписокДоверенностей)
	
	Перем Результат;
	Перем ТекстЗапроса, Запрос, Выборка, ВыборкаДетальныхЗаписей;
	Перем СписокПредставителей, СписокСертификатов, ДанныеКолонок;
	Перем НаименованиеСертификата;
	
	Результат = Новый Соответствие;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Тип КАК Тип,
	|	ВложенныйЗапрос.Наименование КАК Наименование,
	|	ВложенныйЗапрос.Отпечаток КАК Отпечаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ККСНГ_МашиночитаемыеДоверенностиПредставители.Ссылка КАК Ссылка,
	|		ККСНГ_МашиночитаемыеДоверенностиПредставители.Наименование КАК Наименование,
	|		NULL КАК Отпечаток,
	|		""Представитель"" КАК Тип
	|	ИЗ
	|		Справочник.ККСНГ_МашиночитаемыеДоверенности.Представители КАК ККСНГ_МашиночитаемыеДоверенностиПредставители
	|	ГДЕ
	|		ККСНГ_МашиночитаемыеДоверенностиПредставители.Ссылка В(&СписокДоверенностей)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ККСНГ_МашиночитаемыеДоверенностиСертификаты.Ссылка,
	|		ККСНГ_МашиночитаемыеДоверенностиСертификаты.Наименование,
	|		ККСНГ_МашиночитаемыеДоверенностиСертификаты.Отпечаток,
	|		""Сертификат""
	|	ИЗ
	|		Справочник.ККСНГ_МашиночитаемыеДоверенности.Сертификаты КАК ККСНГ_МашиночитаемыеДоверенностиСертификаты
	|	ГДЕ
	|		ККСНГ_МашиночитаемыеДоверенностиСертификаты.Ссылка В(&СписокДоверенностей)) КАК ВложенныйЗапрос
	|ИТОГИ ПО
	|	Ссылка";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокДоверенностей", СписокДоверенностей);
	
	Попытка
		
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл
			
			СписокПредставителей = Новый СписокЗначений;
			СписокСертификатов = Новый СписокЗначений;
			
			ВыборкаДетальныхЗаписей = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
				
				Если ВыборкаДетальныхЗаписей.Тип = "Представитель" Тогда
					СписокПредставителей.Добавить(ВыборкаДетальныхЗаписей.Наименование);
				ИначеЕсли ВыборкаДетальныхЗаписей.Тип = "Сертификат" Тогда
					НаименованиеСертификата = ?(ПустаяСтрока(ВыборкаДетальныхЗаписей.Наименование), ВыборкаДетальныхЗаписей.Отпечаток, ВыборкаДетальныхЗаписей.Наименование);
					СписокСертификатов.Добавить(НаименованиеСертификата);
				Иначе
					Продолжить;
				КонецЕсли;
				
			КонецЦикла;
			
			ДанныеКолонок = Новый Структура;
			ДанныеКолонок.Вставить("СписокПредставителей", ?(СписокПредставителей.Количество() > 0, СписокПредставителей, Неопределено));
			ДанныеКолонок.Вставить("СписокСертификатов", ?(СписокСертификатов.Количество() > 0, СписокСертификатов, Неопределено));
			
			Результат.Вставить(Выборка.Ссылка, ДанныеКолонок);
			
		КонецЦикла;
		
	Исключение
		Возврат Результат;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
